In [8]:
import numpy as np
import pandas as pd

In [9]:
df = pd.read_csv("./EuroMillions_results.csv", delimiter="|", header=0)

In [10]:
df

,Draw Date,Ball 1,Ball 2,Ball 3,Ball 4,Ball 5,Lucky 1,Lucky 2,Jackpot
0,Friday 31st Dec 2004,7,8,24,25,47,8,9,"7,074,000"
1,Friday 24th Dec 2004,3,4,27,29,37,5,6,"7,037,000"
2,Friday 17th Dec 2004,15,19,22,46,49,2,9,"17,973,434"
3,Friday 10th Dec 2004,1,3,13,16,43,2,7,"12,388,642"
4,Friday 3rd Dec 2004,1,11,15,42,49,3,4,"6,945,000"
...,...,...,...,...,...,...,...,...,...
1549,Tuesday 18th Jan 2022,3,12,19,24,30,2,5,"56,246,458"
1550,Friday 14th Jan 2022,6,17,25,31,46,9,12,"46,600,782"
1551,Tuesday 11th Jan 2022,4,23,32,33,44,9,12,"34,392,715"
1552,Friday 7th Jan 2022,2,14,37,44,50,7,11,"25,451,971"
1553,Tuesday 4th Jan 2022,18,28,35,36,41,6,11,"14,189,900"

In [16]:
df[["Ball 1","Ball 2","Ball 3","Ball 4","Ball 5","Lucky 1","Lucky 2"]].value_counts()

Ball 1  Ball 2  Ball 3  Ball 4  Ball 5  Lucky 1  Lucky 2
1       2       5       15      42      5        8          1
10      12      23      32      50      4        10         1
        16      18      31      42      2        5          1
        15      39      45      50      9        10         1
                35      44      50      3        5          1
                                                           ..
4       17      29      35      49      1        2          1
                26      30      43      6        11         1
                24      27      31      10       11         1
                23      36      46      6        10         1
38      39      45      46      49      7        8          1
Length: 1554, dtype: int64

In [43]:
balls = [x for x in df["Ball 1"]]
balls += [x for x in df["Ball 2"]]
balls += [x for x in df["Ball 3"]]
balls += [x for x in df["Ball 4"]]
balls += [x for x in df["Ball 5"]]

In [42]:
len(balls)

7770

In [48]:
new_df = pd.DataFrame()

In [49]:
new_df["Balls"] = balls

In [51]:
new_df["Balls"].value_counts()

23    176
19    175
50    174
17    172
44    172
42    172
38    172
21    171
25    167
5     167
10    167
26    167
29    167
37    166
27    164
30    163
15    163
20    162
1     160
12    160
14    160
4     160
49    158
45    157
3     156
7     156
6     156
11    155
39    154
28    153
24    153
43    151
35    150
13    149
31    148
9     147
16    147
36    147
34    146
32    145
48    145
2     143
40    142
8     140
47    137
41    135
18    135
46    131
33    129
22    128
Name: Balls, dtype: int64